Documents/ВедомостьРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ВедомостьРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыполненныеРаботы</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригадир</Name>
					<Comment>Ответственный за работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРаботы</Name>
							<Comment>Идентификатор строки работы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеестрыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполненоНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПоРаботам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРаботы</Name>
							<Comment>Идентификатор строки работы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентУчастия</Name>
							<Comment>Процент участия исполнителя при выполнении данной работы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВедомостьРабот/Ext/ManagerModule.bsl
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Оценка
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВедомостьРабот";
	КомандаПечати.Представление = НСтр("ru = 'Ведомость работ'");
	КомандаПечати.Порядок       = 10;
		
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВедомостьРабот") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ВедомостьРабот",
			"Ведомость работ",
			ПечатьЗаказНаряда(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ОценкаКачестваРабот.ПФ_MXL_ВедомостьРабот");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьЗаказНаряда(МассивОбъектов, ОбъектыПечати = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Макет = ПолучитьМакет("ПФ_MXL_ЗаказНаряд");
	Область_Шапка 				= Макет.ПолучитьОбласть("Шапка");
	Область_Пробел 				= Макет.ПолучитьОбласть("Пробел");  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаряд_ЗаказНаряд";
	
	ДанныеЗаказНаряда = ПолучитьМакет("ДанныеЗаказНаряда");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьРабот.Ссылка,
	|	ВедомостьРабот.Номер,
	|	ВедомостьРабот.Дата,
	|	ВедомостьРабот.Проект,
	|	ВедомостьРабот.Бригадир,
	|	ВедомостьРабот.Бригадир.ЭлектронныйАдрес КАК ЭлектронныйАдрес,
	|	ВедомостьРабот.Проект.Ответственный КАК РуководительПроекта
	|ИЗ
	|	Документ.ВедомостьРабот КАК ВедомостьРабот
	|ГДЕ
	|	ВедомостьРабот.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаШапка = Результат.Выбрать();
	СчСтраниц = 0;
	Пока ВыборкаШапка.Следующий() Цикл
		Если СчСтраниц>0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Область_Шапка.Параметры.Заполнить(ВыборкаШапка);
		Область_Шапка.Параметры.Заголовок = "Заказ-наряд "+ВыборкаШапка.Номер+" от "+Формат(ВыборкаШапка.Дата, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(Область_Шапка);
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;		
		
		//Выводим данные заказ-наряда
		Настройки = ДанныеЗаказНаряда.НастройкиПоУмолчанию;  
		РасширениеПечати.УстановитьПараметр(Настройки, "Ссылка", ВыборкаШапка.Ссылка);
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		РасширениеПечати.ВывестиСКДВТабличныйДокумент(ДанныеЗаказНаряда, ТабличныйДокумент, КомпоновщикНастроек);
				
		СчСтраниц = СчСтраниц+1;
	КонецЦикла;	
	 
	Возврат ТабличныйДокумент;
	
КонецФункции
